ChibiOS/ChibiOS/os/hal/ports/STM32/STM32G4xx/hal_lld.h
/*
 * Check on the system clock.
 */
#if STM32_SYSCLK > STM32_SYSCLK_MAX
  #error "STM32_SYSCLK above maximum rated frequency (STM32_SYSCLK_MAX)"
#endif

/**
 * @brief   AHB frequency.
 */
#if (STM32_HPRE == STM32_HPRE_DIV1) || defined(__DOXYGEN__)
  #define STM32_HCLK                (STM32_SYSCLK / 1)

#elif STM32_HPRE == STM32_HPRE_DIV2
  #define STM32_HCLK                (STM32_SYSCLK / 2)

#elif STM32_HPRE == STM32_HPRE_DIV4
  #define STM32_HCLK                (STM32_SYSCLK / 4)

#elif STM32_HPRE == STM32_HPRE_DIV8
  #define STM32_HCLK                (STM32_SYSCLK / 8)

#elif STM32_HPRE == STM32_HPRE_DIV16
  #define STM32_HCLK                (STM32_SYSCLK / 16)

#elif STM32_HPRE == STM32_HPRE_DIV64
  #define STM32_HCLK                (STM32_SYSCLK / 64)

#elif STM32_HPRE == STM32_HPRE_DIV128
  #define STM32_HCLK                (STM32_SYSCLK / 128)

#elif STM32_HPRE == STM32_HPRE_DIV256
  #define STM32_HCLK                (STM32_SYSCLK / 256)

#elif STM32_HPRE == STM32_HPRE_DIV512
  #define STM32_HCLK                (STM32_SYSCLK / 512)

#else
  #error "invalid STM32_HPRE value specified"
#endif

/*
 * AHB frequency check.
 */
#if STM32_HCLK > STM32_SYSCLK_MAX
  #error "STM32_HCLK exceeding maximum frequency (STM32_SYSCLK_MAX)"
#endif

/**
 * @brief   APB1 frequency.
 */
#if (STM32_PPRE1 == STM32_PPRE1_DIV1) || defined(__DOXYGEN__)
  #define STM32_PCLK1               (STM32_HCLK / 1)

#elif STM32_PPRE1 == STM32_PPRE1_DIV2
  #define STM32_PCLK1               (STM32_HCLK / 2)

#elif STM32_PPRE1 == STM32_PPRE1_DIV4
  #define STM32_PCLK1               (STM32_HCLK / 4)

#elif STM32_PPRE1 == STM32_PPRE1_DIV8
  #define STM32_PCLK1               (STM32_HCLK / 8)

#elif STM32_PPRE1 == STM32_PPRE1_DIV16
  #define STM32_PCLK1               (STM32_HCLK / 16)

#else
  #error "invalid STM32_PPRE1 value specified"
#endif

/*
 * APB1 frequency check.
 */
#if STM32_PCLK1 > STM32_PCLK1_MAX
#error "STM32_PCLK1 exceeding maximum frequency (STM32_PCLK1_MAX)"
#endif

/**
 * @brief   APB2 frequency.
 */
#if (STM32_PPRE2 == STM32_PPRE2_DIV1) || defined(__DOXYGEN__)
  #define STM32_PCLK2               (STM32_HCLK / 1)

#elif STM32_PPRE2 == STM32_PPRE2_DIV2
  #define STM32_PCLK2               (STM32_HCLK / 2)

#elif STM32_PPRE2 == STM32_PPRE2_DIV4
  #define STM32_PCLK2               (STM32_HCLK / 4)

#elif STM32_PPRE2 == STM32_PPRE2_DIV8
  #define STM32_PCLK2               (STM32_HCLK / 8)

#elif STM32_PPRE2 == STM32_PPRE2_DIV16
  #define STM32_PCLK2               (STM32_HCLK / 16)

#else
  #error "invalid STM32_PPRE2 value specified"
#endif

/*
 * APB2 frequency check.
 */
#if STM32_PCLK2 > STM32_PCLK2_MAX
#error "STM32_PCLK2 exceeding maximum frequency (STM32_PCLK2_MAX)"
#endif

/**
 * @brief   MCO divider clock frequency.
 */
#if (STM32_MCOSEL == STM32_MCOSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_MCODIVCLK           0

#elif STM32_MCOSEL == STM32_MCOSEL_SYSCLK
  #define STM32_MCODIVCLK           STM32_SYSCLK

#elif STM32_MCOSEL == STM32_MCOSEL_HSI16
  #define STM32_MCODIVCLK           STM32_HSI16CLK

#elif STM32_MCOSEL == STM32_MCOSEL_HSE
  #define STM32_MCODIVCLK           STM32_HSECLK

#elif STM32_MCOSEL == STM32_MCOSEL_PLLRCLK
  #define STM32_MCODIVCLK           STM32_PLL_R_CLKOUT

#elif STM32_MCOSEL == STM32_MCOSEL_LSI
  #define STM32_MCODIVCLK           STM32_LSICLK

#elif STM32_MCOSEL == STM32_MCOSEL_LSE
  #define STM32_MCODIVCLK           STM32_LSECLK

#elif STM32_MCOSEL == STM32_MCOSEL_HSI48
  #define STM32_MCODIVCLK           STM32_HSI48CLK

#else
  #error "invalid STM32_MCOSEL value specified"
#endif

/**
 * @brief   MCO output pin clock frequency.
 */
#if (STM32_MCOPRE == STM32_MCOPRE_DIV1) || defined(__DOXYGEN__)
  #define STM32_MCOCLK              STM32_MCODIVCLK

#elif STM32_MCOPRE == STM32_MCOPRE_DIV2
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 2)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV4
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 4)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV8
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 8)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV16
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 16)

#else
#error "invalid STM32_MCOPRE value specified"
#endif

/**
 * @brief   RTC clock frequency.
 */
#if (STM32_RTCSEL == STM32_RTCSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_RTCCLK              0

#elif STM32_RTCSEL == STM32_RTCSEL_LSE
  #define STM32_RTCCLK              STM32_LSECLK

#elif STM32_RTCSEL == STM32_RTCSEL_LSI
  #define STM32_RTCCLK              STM32_LSICLK

#elif STM32_RTCSEL == STM32_RTCSEL_HSEDIV
  #define STM32_RTCCLK              (STM32_HSECLK / 32)

#else
  #error "invalid STM32_RTCSEL value specified"
#endif

/**
 * @brief   USART1 clock frequency.
 */
#if (STM32_USART1SEL == STM32_USART1SEL_PCLK2) || defined(__DOXYGEN__)
  #define STM32_USART1CLK           STM32_PCLK2

#elif STM32_USART1SEL == STM32_USART1SEL_SYSCLK
  #define STM32_USART1CLK           STM32_SYSCLK

#elif STM32_USART1SEL == STM32_USART1SEL_HSI16
  #define STM32_USART1CLK           STM32_HSI16CLK

#elif STM32_USART1SEL == STM32_USART1SEL_LSE
  #define STM32_USART1CLK           STM32_LSECLK

#else
  #error "invalid source selected for USART1 clock"
#endif

 /**
  * @brief   USART2 clock frequency.
  */
 #if (STM32_USART2SEL == STM32_USART2SEL_PCLK1) || defined(__DOXYGEN__)
   #define STM32_USART2CLK           STM32_PCLK1

 #elif STM32_USART2SEL == STM32_USART2SEL_SYSCLK
   #define STM32_USART2CLK           STM32_SYSCLK

 #elif STM32_USART2SEL == STM32_USART2SEL_HSI16
   #define STM32_USART2CLK           STM32_HSI16CLK

 #elif STM32_USART2SEL == STM32_USART2SEL_LSE
   #define STM32_USART2CLK           STM32_LSECLK

 #else
   #error "invalid source selected for USART2 clock"
 #endif

 /**
  * @brief   USART3 clock frequency.
  */
 #if (STM32_USART3SEL == STM32_USART3SEL_PCLK1) || defined(__DOXYGEN__)
   #define STM32_USART3CLK           STM32_PCLK1

